<img src='./img/intel-logo.jpg' width=50%, Fig1> 

# 판다스 기초강의
<font size=5><b>04. 데이터 합치기 <b></font>

<div align='right'>성  민  석 (Minsuk  Sung)</div>
<div align='right'>류  회  성 (Hoesung Ryu)</div>

<img src='./img/pandas-logo.png' width=50%, Fig2> 


---

<h1>강의목차<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#pd.concat()" data-toc-modified-id="pd.concat()-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>pd.concat()</a></span><ul class="toc-item"><li><span><a href="#concat(-axis-=1-)" data-toc-modified-id="concat(-axis-=1-)-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>concat( axis =1 )</a></span></li><li><span><a href="#concat(axis=0)" data-toc-modified-id="concat(axis=0)-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>concat(axis=0)</a></span></li><li><span><a href="#concat(axis=0)-ignore_index" data-toc-modified-id="concat(axis=0)-ignore_index-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>concat(axis=0) ignore_index</a></span></li></ul></li><li><span><a href="#pd.merge()" data-toc-modified-id="pd.merge()-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>pd.merge()</a></span><ul class="toc-item"><li><span><a href="#주요-파라미터-(-pd.merge(df1,df2,-on-=-???))" data-toc-modified-id="주요-파라미터-(-pd.merge(df1,df2,-on-=-???))-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>주요 파라미터 ( pd.merge(df1,df2, on = ???))</a></span></li><li><span><a href="#inner-join" data-toc-modified-id="inner-join-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>inner join</a></span></li><li><span><a href="#left-outer-join" data-toc-modified-id="left-outer-join-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>left outer join</a></span></li><li><span><a href="#right-outer-join" data-toc-modified-id="right-outer-join-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>right outer join</a></span></li><li><span><a href="#fully-outer-join" data-toc-modified-id="fully-outer-join-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>fully outer join</a></span></li></ul></li></ul></div>

## pd.concat()

$n$ 개의 데이터 프레임을 컬럼 기준의 합치고 싶은 경우 `axis`를 설정 한 후`concate()`함수를 사용한다.

### concat( axis =1 )
<img src="img/concat_axis1.png"  style="width: 700px;"/>

In [34]:
# DataFrame　생성

import pandas as pd

# df1 생성
df1 = pd.DataFrame([
                    ['Hong', 'Gildong'],
                    ['Sung', 'Munsuk'],
                    ['Ryu', 'Hoesung'],
                    ['Hwang', 'Jinha'],
                    ], index=['1','2','3', '4'], columns=['Last name', 'First name']
                    )
# print 대신 display를 쓰면 이쁘게 출력된다. 
display(df1)

  Last name First name
1      Hong    Gildong
2      Sung     Munsuk
3       Ryu    Hoesung
4     Hwang      Jinha

In [35]:
# df2 생성
df2 = pd.DataFrame([
                    ['Pyonyang', 21],
                    ['Seoul', 27],
                    ['Jeju', 29],
                    ['Gyeonggi-do', 30]
                    ], index=['1','2','3', '4'], columns=['City', 'Age']
                    )

# print 대신 display를 쓰면 이쁘게 출력된다. 
display(df2)

          City  Age
1     Pyonyang   21
2        Seoul   27
3         Jeju   29
4  Gyeonggi-do   30

In [36]:
# concat with axis = 1 수행
df = pd.concat([df1,df2], axis=1,sort=True)
df

  Last name First name         City  Age
1      Hong    Gildong     Pyonyang   21
2      Sung     Munsuk        Seoul   27
3       Ryu    Hoesung         Jeju   29
4     Hwang      Jinha  Gyeonggi-do   30

### concat(axis=0)

<img src="img/concat_axis0.png" style="width: 700px;"/>

In [37]:
# df1 생성
df1 = pd.DataFrame([
                    ['Hong', 'Gildong'],
                    ['Sung', 'Munsuk'],
                    ['Ryu', 'Hoesung'],
                    ['Hwang', 'Jinha'],
                    ], index=['1','2','3', '4'], columns=['Last name', 'First name']
                    )

In [38]:
# df2 생성
df2 = pd.DataFrame([
                    ['Lee', 'Chang'],
                    ['Kim', 'Chi'],
                    ], index=['1','2'], columns=['Last name', 'First name']
                    )

In [39]:
# concat with axis = 0 수행
df = pd.concat([df1,df2], axis=0,sort=True)
df

  First name Last name
1    Gildong      Hong
2     Munsuk      Sung
3    Hoesung       Ryu
4      Jinha     Hwang
1      Chang       Lee
2        Chi       Kim

### concat(axis=0) ignore_index
<img src="img/concat_axis0_ignore.png" style="width: 700px;"/>

In [40]:
df = pd.concat([df1,df2], axis=0,sort=True,ignore_index=True)
df

  First name Last name
0    Gildong      Hong
1     Munsuk      Sung
2    Hoesung       Ryu
3      Jinha     Hwang
4      Chang       Lee
5        Chi       Kim

## pd.merge()

### 주요 파라미터 ( pd.merge(df1,df2, on = ???))

- 키를 기준으로 DataFrame의 로우를 합친다. SQL이나 다른 관계형 데이터베이스의 join 연산과 동일함.
- 주요 파라미터        
  . left, right : merge할 DataFrame 객체이름

  . how = 'inner', #left, right, outer

  . on = None, #merge의 기준이 되는 컬럼

  . left_on = None, #left DataFrame의 기준 컬럼

  . right_on = None, #right DataFrame의 기준 컬럼

In [42]:
# DataFrame 생성
df_left = pd.DataFrame({'KEY': ['k0', 'k1', 'k2', 'k3'],
                     'A': ['a0', 'a1', 'a2', 'a3'],
                     'B': ['b0', 'b1', 'b2', 'b3']})
df_right = pd.DataFrame({'KEY': ['k2', 'k3', 'k4', 'k5'],
                     'C': ['c2', 'c3', 'c4', 'c5'],
                     'D': ['d2', 'd3', 'd4', 'd5']})

In [49]:
print('df_left:')
display(df_left)
print('-'*15)
print('df_right:')
display(df_right)

df_left:

  KEY   A   B
0  k0  a0  b0
1  k1  a1  b1
2  k2  a2  b2
3  k3  a3  b3

---------------
df_right:

  KEY   C   D
0  k2  c2  d2
1  k3  c3  d3
2  k4  c4  d4
3  k5  c5  d5

### inner join

In [50]:
# 4 * 4 = 16번의 연산이 이루어짐
# key값이 같은 놈이 나옴 => k2,k3
pd.merge(df_left,df_right,how='inner') # inner join이란것을 알려주기 위해서

  KEY   A   B   C   D
0  k2  a2  b2  c2  d2
1  k3  a3  b3  c3  d3

### left outer join

In [51]:
# left에 있는 데이터는 일단 다 출력해달라 -> 없는 놈은 NaN 처리하더라도
pd.merge(df_left,df_right,how='left')

  KEY   A   B    C    D
0  k0  a0  b0  NaN  NaN
1  k1  a1  b1  NaN  NaN
2  k2  a2  b2   c2   d2
3  k3  a3  b3   c3   d3

### right outer join

In [52]:
pd.merge(df_left,df_right,how='right')

  KEY    A    B   C   D
0  k2   a2   b2  c2  d2
1  k3   a3   b3  c3  d3
2  k4  NaN  NaN  c4  d4
3  k5  NaN  NaN  c5  d5

### fully outer join

In [53]:
pd.merge(df_left,df_right,how='outer') # 둘 중 한군데라도 있으면 출력

  KEY    A    B    C    D
0  k0   a0   b0  NaN  NaN
1  k1   a1   b1  NaN  NaN
2  k2   a2   b2   c2   d2
3  k3   a3   b3   c3   d3
4  k4  NaN  NaN   c4   d4
5  k5  NaN  NaN   c5   d5